## Pandas documentation learn

In [4]:
import pandas as pd
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry", 
            "Bonnell, Miss. Elizabeth",
            "Farid, Md. Hossain Akanda",
        ],
        "Age": [22, 35, 58, 27],
        "Sex": ["male", "male", "female", "male"],
    }
)
df

                        Name  Age     Sex
0    Braund, Mr. Owen Harris   22    male
1   Allen, Mr. William Henry   35    male
2   Bonnell, Miss. Elizabeth   58  female
3  Farid, Md. Hossain Akanda   27    male

In [5]:
df["Age"]

0    22
1    35
2    58
3    27
Name: Age, dtype: int64

In [6]:
ages = pd.Series([22, 35, 58, 27], name="Age")

In [7]:
ages

0    22
1    35
2    58
3    27
Name: Age, dtype: int64

In [8]:
df["Age"].max()

58

In [9]:
ages.max()

58

In [10]:
df.describe()

             Age
count   4.000000
mean   35.500000
std    15.926916
min    22.000000
25%    25.750000
50%    31.000000
75%    40.750000
max    58.000000